WeatherCountryInf_CA_/test/TestCase3_A_reply_fault/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://j2ee.netbeans.org/wsdl/CountryDetail_Information/src/Custumer">
  <soapenv:Body>
    <cus:CustumerOperation>
      <IP_address></IP_address>
    </cus:CustumerOperation>
  </soapenv:Body>
</soapenv:Envelope>